app/Controllers/EventoController.php

        public function index(){
            $eventos= $this->eventosModel->obtenerEventos()->findAll();
---
SELECT `eventos`.*, `clientes`.`nombre` AS `nombre_cliente`, `categorias`.`nombre` AS `nombre_categoria`
FROM `eventos`
JOIN `clientes` ON `eventos`.`cliente_id` = `clientes`.`id`
JOIN `categorias` ON `eventos`.`categoria_id` = `categorias`.`id`

        public function store(){
            $data=array(
                "nombre"=>$this->request->getPost("nombre"),
                "categoria_id"=>$this->request->getPost("categoria_id"),
                "cliente_id"=> $this->request->getPost("cliente_id"),
                "fecha_evento"=> $this->request->getPost("fecha_evento"),
                "paquete_id"=> $this->request->getPost("paquete_id"),
                "estado"=> $this->request->getPost("estado")
            );
            $this->eventosModel->save($data);
---
INSERT INTO `eventos` (`nombre`, `categoria_id`, `cliente_id`, `fecha_evento`, `paquete_id`, `estado`, `created_at`, `updated_at`) VALUES ('Cumpleaños', '4', '1', '2024-12-31', NULL, 'Pendiente', '2024-12-02 02:06:02', '2024-12-02 02:06:02')

        public function edit($id){
            $evento=$this->eventosModel->find($id);
---
SELECT *
FROM `eventos`
WHERE `eventos`.`id` = '1'

        public function update($id){
            $data=array(
                "nombre"=>$this->request->getPost("nombre"),
                "categoria_id"=>(int) $this->request->getPost("categoria_id"),
                "cliente_id"=> $this->request->getPost("cliente_id"),
                "fecha_evento"=> $this->request->getPost("fecha_evento"),
                "paquete_id"=> $this->request->getPost("paquete_id"),
                "estado"=> $this->request->getPost("estado")
            );
            $this->eventosModel->update($id,$data);
---
UPDATE `eventos` SET `nombre` = 'BOda', `categoria_id` = 4, `cliente_id` = '2', `fecha_evento` = '2024-11-29', `paquete_id` = NULL, `estado` = 'Pendiente', `updated_at` = '2024-12-02 02:06:27'
WHERE `eventos`.`id` IN ('1')

        public function delete($id){
            $this->eventosModel->delete($id);
---
DELETE FROM `eventos`
WHERE `id` IN ('2')