app/Controllers/UsuarioController.php

INSERT INTO `usuarios` (`nombre`, `telefono`, `correo`, `password_usuario`, `created_at`, `updated_at`) VALUES ('Gaby', '6221420476', 'Gaby@gmail.com', 'Gaby', '2024-11-13 15:54:58', '2024-11-13 15:54:58')
---
    public function store(){
        $data=array(
            "nombre" => $this->request->getPost("nombre"),
            "telefono" => $this->request->getPost("telefono"),
            "correo" => $this->request->getPost("correo"),
            "password_usuario" => $this->request->getPost("password_usuario")
        );
        $this->usuarioModel->save($data);

DELETE FROM `usuarios`
WHERE `id` IN ('7')
---
    public function delete($id){
        $this->usuarioModel->delete($id);